Revit 2027 API
ScheduleDefinition.CanFilter Method
 Checks whether filters can be added to this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilter()
Public Function CanFilter As Boolean
public:
bool CanFilter()
member CanFilter : unit -> bool
Return Value
Boolean
 True if this ScheduleDefinition supports filters, false otherwise.
Remarks
 Key schedules and revision schedules do not support filters.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace